[
  {
    "Date": "2026-02-06",
    "Executive Headline": "Ferrari 849 Testarossa review: A legacy reimagined",
    "Summary": "Ferrari’s revived 849 Testarossa is the SF90 replacement and takes over as the flagship of the legendary Italian sportscar maker’s regular range. It mixes a proper heritage badge and design cues from the 1970s / 80s with a very modern and potent plug-in hybrid powertrain. Ferrari has taken the basic ingredients of the SF90, added dollops of nostalgia, tech and spice to cook up the most powerful production Ferrari short of the F80. Producing 1,050hp and rocketing to 100kph from standstill in 2. 3.",
    "Source URL": "https://www.autocarindia.com/car-reviews/ferrari-849-testarossa-review-a-legacy-reimagined-440326",
    "Source": "Auto india",
    "Cluster ID": 0,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Tata Motors to debut Punch EV facelift on February 20",
    "Summary": "The Tata Punch EV facelift is going to debut in India on February 20, 2026. The e-SUV has been on sale in India since January 2024. While the details of the facelifted model are unknown, it is likely to take plenty of inspiration from the ICE-powered Punch, which received its mid-cycle update in January 2026. Expected to be offered with the same 25kWh and 35kWh battery packsLikely to get redesigned front and rear bumpers and connected taillightsNew features could include a 12. 3-inch touchscr...",
    "Source URL": "https://www.autocarindia.com/car-news/tata-motors-to-debut-punch-ev-facelift-on-february-438986",
    "Source": "Auto india",
    "Cluster ID": 1,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "TVS made BMW F 450 sportbike spotted testing",
    "Summary": "A test mule of a new faired supersport has been spotted on test and it appears to be based on the same platform as the upcoming BMW F 450 GS. Here’s a look at everything it shares with the F 450 GS and what we can deduce from the spy shots. 1. Upcoming BMW Supersport to share engine with the F 450 GS2. Test mule gets BMW branded brake calipers3.",
    "Source URL": "https://www.autocarindia.com/bike-news/tvs-made-bmw-f-450-sportbike-spotted-testing-438985",
    "Source": "Auto india",
    "Cluster ID": 2,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Prices for Toyota Hyryder, Taisor increased by up to Rs 21,000",
    "Summary": "Toyota India has now increased prices of the Hyryder, Taisor, Glanza and Rumion, all of which are badge-engineered models developed under the carmaker's partnership with Maruti Suzuki. This comes after an earlier price hike last month for the Fortuner, Innova Hycross and Innova Crysta. While the carmaker has not specified a reason for the hike, rising input and production costs are likely factors. 2026 Toyota Urban Cruiser Hyryder price listUp to Rs 21,000Toyota Hyryder prices (in Rs, lakh)Va...",
    "Source URL": "https://www.autocarindia.com/car-news/prices-for-toyota-hyryder-taisor-increased-by-up-to-rs-438983",
    "Source": "Auto india",
    "Cluster ID": 3,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "10 cheapest cars with a sunroof under Rs 10 lakh",
    "Summary": "Sunroofs have become a near-ubiquitous feature in India’s mass-market models owing to immense demand from buyers. They were mostly seen in the premium end of the price spectrum, but these days, sunroofs are available even in cars and SUVs priced under Rs 10 lakh. Here’s a list of the most affordable cars in India with a single-pane sunroof. Note: Images of the top-spec trims of the cars are used for representation only. 10.",
    "Source URL": "https://www.autocarindia.com/auto-features/cheapest-cars-in-india-under-rs-10-lakh-with-a-sunroof-432602",
    "Source": "Auto india",
    "Cluster ID": 4,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Volkswagen Tayron vs Tiguan: Similarities and differences explained",
    "Summary": "German carmaker Volkswagen recently revealed the India-spec Tayron, with bookings already underway. The new 7-seater SUV will sit above the Tiguan in VW’s line-up, becoming the brand’s flagship SUV in India upon its launch around March 2026. Volkswagen has chosen the R-Line trim for the Tayron as well. Having said that, let us now look at how these two stack up against each other on the grounds of their shared commonalities and also on aspects that set them apart. Volkswagen Tayron vs Tiguan:...",
    "Source URL": "https://www.autocarindia.com/auto-features/volkswagen-tayron-vs-tiguan-similarities-and-differences-explained-440180",
    "Source": "Auto india",
    "Cluster ID": 5,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Tata Sierra naturally aspirated petrol video review",
    "Summary": "The new Tata Sierra has been drawing plenty of attention for its standout design and smart packaging. We drive the manual and automatic versions of the all-new 1. 5-litre naturally aspirated petrol to see if this base powertrain is worth buying.",
    "Source URL": "https://www.autocarindia.com/car-video-reviews/tata-sierra-naturally-aspirated-petrol-video-review-440325",
    "Source": "Auto india",
    "Cluster ID": 6,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "IEA: Electricity demand is rising fast, and grids can’t keep up",
    "Summary": "Global electricity demand is surging, and the grid is struggling to keep up, according to a new report from the International Energy Agency (IEA). more….",
    "Source URL": "https://electrek.co/2026/02/05/iea-electricity-demand-is-rising-fast-and-grids-cant-keep-up/",
    "Source": "Electrek",
    "Cluster ID": 7,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Microchip & Hyundai team up to explore single-pair Ethernet for future vehicle networks",
    "Summary": "Press Release, 6 February 2026 Microchip Technology and Hyundai Motor Group have announced a collaborative effort to investigate the use of 10BASE-T1S Single Pair Ethernet (SPE) as a next-generation in-vehicle networking standard for tomorrow’s connected and smart vehicles. The initiative aims to evaluate how this cutting-edge Ethernet technology can streamline vehicle architecture, improve connectivity performance, ….",
    "Source URL": "https://telematicswire.net/microchip-hyundai-team-up-to-explore-single-pair-ethernet-for-future-vehicle-networks/",
    "Source": "Telematics Wire",
    "Cluster ID": 8,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Tier IV picked for ATLA-led study on autonomous support vehicles for Japan’s defense bases",
    "Summary": "Press Release, 6 February 2026 Japanese autonomous driving specialist Tier IV has been chosen to participate in a government-backed research initiative led by the Acquisition, Technology & Logistics Agency (ATLA), exploring how self-driving technologies could be applied to support operations at Maritime Self-Defense Force (SDF) facilities. The study will investigate the potential deployment of autonomous ….",
    "Source URL": "https://telematicswire.net/tier-iv-picked-for-atla-led-study-on-autonomous-support-vehicles-for-japans-defense-bases/",
    "Source": "Telematics Wire",
    "Cluster ID": 9,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Valeo & Anritsu team up to speed digital twin validation for software-defined vehicles",
    "Summary": "Press Release, 6 February 2026 Valeo and Anritsu have announced a strategic collaboration aimed at dramatically improving how connected, software-defined vehicles are tested and validated before they hit the road. As modern vehicles evolve into cloud-connected computers on wheels, traditional hardware-based testing methods struggle to keep up with the growing complexity, cost and time demands ….",
    "Source URL": "https://telematicswire.net/valeo-anritsu-team-up-to-speed-digital-twin-validation-for-software-defined-vehicles/",
    "Source": "Telematics Wire",
    "Cluster ID": 10,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Indie, Mahindra join forces to bring smart in-cabin safety to electric SUVs",
    "Summary": "Press Release, 6 February 2026 indie Semiconductor has struck a strategic partnership with Mahindra & Mahindra Limited to power one of the most advanced in-cabin safety systems available in the Indian automotive market. The collaboration combines indie’s recently acquired emotion3D CABIN EYE® perception software with Mahindra’s custom EyeDentity camera-based driver and occupant monitoring hardware for ….",
    "Source URL": "https://telematicswire.net/indie-mahindra-join-forces-to-bring-smart-in-cabin-safety-to-electric-suvs/",
    "Source": "Telematics Wire",
    "Cluster ID": 11,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Bitsensing launches Retrofit ADAS kit to boost safety for commercial fleets",
    "Summary": "Press Release, 6 February 2026 South Korean technology firm Bitsensing has introduced a new aftermarket Advanced Driver Assistance Systems (ADAS) kit designed to bring advanced safety features to existing buses, trucks and other commercial vehicles that were not originally built with such systems. The affordable retrofit solution pairs radar and cameras to deliver real-time warnings ….",
    "Source URL": "https://telematicswire.net/bitsensing-launches-retrofit-adas-kit-to-boost-safety-for-commercial-fleets/",
    "Source": "Telematics Wire",
    "Cluster ID": 12,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "Hyundai Venue top-spec vs Creta mid-spec: Features, specs compared",
    "Summary": "The latest iteration of the Hyundai Venue was launched nearly two years after the Creta facelift. Both these cars represent Hyundai’s top sellers within their respective segments. However, which one of these should you choose if your budget lies between Rs 14 lakh and Rs 17 lakh. That is what we will find out by comparing their key features and specifications to see which model offers the better value-for-money proposition. Hyundai Venue vs Creta: DimensionsThe Creta is larger than the Venue.",
    "Source URL": "https://www.autocarindia.com/auto-features/hyundai-venue-top-spec-vs-creta-mid-spec-features-specs-compared-440175",
    "Source": "Auto india",
    "Cluster ID": 13,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-06",
    "Executive Headline": "5 things to know before buying the Aprilia RS 457",
    "Summary": "The Aprilia RS 457 is about as close as you'll come to a big-bike feel at a somewhat digestible price. Designed in Italy and manufactured in India, the bike takes great inspiration from the RS 660 and offers a captivating design combined with impressive performance. If you're considering one, here are answers to some of the most common questions. What is the price of the Aprilia RS 457 in India. The Aprilia RS 457 is priced at Rs 4.",
    "Source URL": "https://www.autocarindia.com/auto-features/5-things-to-know-before-buying-the-aprilia-rs-440181",
    "Source": "Auto india",
    "Cluster ID": 14,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "New VW Sportline is the 7-passenger electric GTi the ID.Buzz SHOULD have been",
    "Summary": "VW have finally built the van enthusiasts have been asking — and it’s not the ID. Buzz. Meet the new e-Transporter Sportline, the retro-tastic people-mover with GTI-inspired styling, a proper performance attitude, and room for seven that VW should have been building all along. more….",
    "Source URL": "https://electrek.co/2026/02/05/new-vw-sportline-is-the-7-passenger-electric-gti-the-id-buzz-should-have-been/",
    "Source": "Electrek",
    "Cluster ID": 15,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "The world’s first sodium-ion battery EV is here and it could be a game changer",
    "Summary": "Leading global battery maker CATL and Changan Automobile unveiled the world’s first passenger EV powered by a sodium-ion battery on Thursday. more….",
    "Source URL": "https://electrek.co/2026/02/05/first-sodium-ion-battery-ev-debuts-game-changer/",
    "Source": "Electrek",
    "Cluster ID": 16,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "5 Christian Athletes to Cheer On During the 2026 Winter Olympics",
    "Summary": "Here are five Christian athletes who carry their faith with them to the world’s stage in the 2026 Winter Olympics. The post 5 Christian Athletes to Cheer On During the 2026 Winter Olympics appeared first on Plugged In.",
    "Source URL": "https://www.pluggedin.com/blog/5-christian-athletes-to-cheer-on-during-the-2026-winter-olympics/",
    "Source": "Plugged In",
    "Cluster ID": 17,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Why Slate's CEO Isn't Too Worried About Cheap Chinese EVs",
    "Summary": "We asked the head of America's buzziest EV startup about where the company stands, the Slate truck's price and competition with BYD.",
    "Source URL": "https://insideevs.com/news/786194/slate-ceo-interview-q-a-price-china-battery-2026/",
    "Source": "Inside EVs",
    "Cluster ID": 18,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Ford’s $30,000 EV Pickup Takes A Page From Tesla To Transform How Cars Are Built",
    "Summary": "Ford CEO Jim Farley shared a bit more about the mysterious pickup on social media on Thursday.",
    "Source URL": "https://insideevs.com/news/786534/ford-midsize-ev-pickup-gigacasting/",
    "Source": "Inside EVs",
    "Cluster ID": 19,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Xpeng reveals first images of GX flagship SUV with Range Rover styling and steer-by-wire",
    "Summary": "Xpeng has unveiled the first official images of the GX, its new flagship six-seat SUV that takes clear design inspiration from the Range Rover while packing the company’s most advanced technology yet. The Chinese EV maker shared three images of the GX on Weibo today, revealing a sleek full-size SUV that will compete directly with premium rivals like the Li Auto L9, Huawei’s Aito M9, Zeekr 9X, and the upcoming Nio ES9. more….",
    "Source URL": "https://electrek.co/2026/02/05/xpeng-reveals-first-images-of-gx-flagship-suv-with-range-rover-styling-and-steer-by-wire/",
    "Source": "Electrek",
    "Cluster ID": 20,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Segway GT3 SuperScooter at $1,500 low, EcoFlow DELTA 2 Max new $829 low + increased exclusive DEL...",
    "Summary": "We’ve got an exciting edition of Green Deals filled with new and returning low prices alike, starting with Segway’s highly advanced GT3 SuperScooter back at its $1,500 low and featuring Apple Find My, proximity locking, navigation, and so much more. From there, we have been surprised by a wide array of EcoFlow device lows, starting with the latest flash sale that has dropped the DELTA 2 Max Portable Power Station to a new $829 low. We also have increased exclusive savings on the DELTA Pro Ultra.",
    "Source URL": "https://electrek.co/2026/02/05/segway-gt3-superscooter-ecoflow-delta-2-max-delta-pro-ultra-more/",
    "Source": "Electrek",
    "Cluster ID": 21,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Apple was once ‘carpet bombing’ Tesla with recruiting calls, per Elon Musk",
    "Summary": "Apple once had ambitions of building an electric car, and during that period, per a new interview with Elon Musk, the company was “relentlessly” trying to poach Tesla employees. more….",
    "Source URL": "https://9to5mac.com/2026/02/05/apple-was-once-carpet-bombing-tesla-with-recruiting-calls-per-elon-musk/",
    "Source": "Electrek",
    "Cluster ID": 22,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Subaru is now building EVs in-house, starting with a new electric SUV",
    "Summary": "The new electric SUV is now rolling off the production line at Subaru’s Gunma Yajima Plant, the first time an EV has been made at the facility. more….",
    "Source URL": "https://electrek.co/2026/02/05/subaru-builds-first-in-house-ev-new-electric-suv/",
    "Source": "Electrek",
    "Cluster ID": 23,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "The World’s First Sodium-Ion Battery EV Is A Winter Range Monster",
    "Summary": "It’s the beginning of a “dual chemistry era” as sodium-ion batteries have overcome all hurdles to enter mass production. ​.",
    "Source URL": "https://insideevs.com/news/786509/catl-changan-worlds-first-sodium-ion-battery-ev/",
    "Source": "Inside EVs",
    "Cluster ID": 24,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Xiaomi SU7 owner puts 165,000 miles on his EV in 18 months, battery health at 94.5%",
    "Summary": "A Xiaomi SU7 owner in China has achieved what might be the most impressive real-world battery longevity test we’ve seen yet: 265,000 kilometers (165,000 miles) in just 18 months of ownership, with battery health still at 94. 5%. more….",
    "Source URL": "https://electrek.co/2026/02/05/xiaomi-su7-owner-puts-165000-miles-on-his-ev-in-18-months-battery-health-at-94-5/",
    "Source": "Electrek",
    "Cluster ID": 25,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Xos expands mobile charging Hub lineup with three capacity options",
    "Summary": "Commercial EV and mobile charging firm Xos has expanded its Hub lineup with three new capacity options to deliver fast mobile charging across Classes 1-2 through to heavy-duty fleet operations. The 210 kWh, 420 kWh and 630 kWh configurations are designed to make rapid-deployment charging infrastructure accessible to fleets of all sizes and duty cycles. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/xos-expands-mobile-charging-hub-lineup-with-three-capacity-options/",
    "Source": "ChargedEVs",
    "Cluster ID": 26,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Kia’s electric hatch drove almost 250 miles and recharged in 33 minutes in the frigid cold",
    "Summary": "The EV4, Kia’s electric hatchback, proved its prowess in the El Prix Winter Test, driving almost 250 miles (390 km) in temperatures as low as –31°C (-23. 8 °F). It also recharged from 10% to 80% in just over 30 minutes. more….",
    "Source URL": "https://electrek.co/2026/02/05/kias-ev-hatch-drove-250-miles-recharged-in-33-mins-frigid-cold/",
    "Source": "Electrek",
    "Cluster ID": 27,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "QuantumScape inaugurates Eagle Line pilot for solid-state battery production",
    "Summary": "Solid-state battery developer QuantumScape is off and running in 2026, inaugurating its shiny new Eagle Line for pilot production. Eagle Line lays the groundwork for scaled solid-state battery production and will produce cells to support OEM customer sampling. more….",
    "Source URL": "https://electrek.co/2026/02/05/quantumscape-inaugurates-eagle-line-pilot-solid-state-battery-production/",
    "Source": "Electrek",
    "Cluster ID": 28,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "CharIN validates comemso EVCA test system for DC charging performance and interoperability",
    "Summary": "CharIN has validated comemso’s EVCA (Electric Vehicle Communication Analyzer and Simulator) as a Conformance Test System for DC EVSE (Charging System Basic and Extended) under the CharIN Conformance Testing System (CCTS) program. comemso reports that this validation matters because it is intended to confirm standard-compliant, reproducible test results that support interoperability across different laboratory configurations. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/the-tech/charin-validates-comemso-evca-test-system-for-dc-charging-performance-and-interoperability/",
    "Source": "ChargedEVs",
    "Cluster ID": 29,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Enabling autonomy with LiDAR: Innoviz at CES",
    "Summary": "How LiDAR is becoming a key facilitating tech for ADAS and autonomous drive.",
    "Source URL": "https://www.just-auto.com/interview/enabling-autonomy-with-lidar-innoviz-at-ces/",
    "Source": "Just Auto",
    "Cluster ID": 30,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "San Bernadino hub can now charge 200 electric semi trucks per day",
    "Summary": "One of the busiest HDEV charging depots in the country got a major upgrade last week, enabling it to charge up to 200 electric semi trucks per day and offer megawatt charging to trucks that can handle the power. more….",
    "Source URL": "https://electrek.co/2026/02/05/san-bernadino-hub-can-now-charge-200-electric-semi-trucks-per-day/",
    "Source": "Electrek",
    "Cluster ID": 31,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Trek shifts itself with a new 28 MPH car-replacing e-bike",
    "Summary": "Trek just pulled the covers off a new top-tier city e-bike aimed squarely at riders who want comfort, power, and polish without turning daily riding into a hobby that requires constant tinkering. The new Trek Charter+ arrives as Trek’s most premium everyday e-bike yet, blending high-end drivetrain tech, deep integration, and a strong focus on car-replacement practicality. more….",
    "Source URL": "https://electrek.co/2026/02/05/trek-shifts-itself-with-a-new-28-mph-car-replacing-e-bike/",
    "Source": "Electrek",
    "Cluster ID": 32,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Cheap Chinese EVs? Canadians Are More Interested Than You’d Think",
    "Summary": "Plus, Germany ranked second-highest in EV production last year, and automakers argue for the safety of robotaxis.",
    "Source URL": "https://insideevs.com/news/786422/canada-chinese-ev-survey-positive/",
    "Source": "Inside EVs",
    "Cluster ID": 33,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Audi announces 2027 A6/Q6 e-tron updates: scroll wheel return, new drift mode, improved regen",
    "Summary": "Audi is rolling out significant updates to its A6 e-tron and Q6 e-tron electric vehicles for the 2027 model year, bringing back physical controls, adding a new “dynamic plus” drift mode, and improving regenerative braking for better efficiency. The changes come as part of a broader update across Audi’s PPE (Premium Platform Electric) lineup, addressing some of the early criticisms of these vehicles while adding genuinely useful new features. more….",
    "Source URL": "https://electrek.co/2026/02/05/audi-announces-2027-a6-q6-e-tron-updates-scroll-wheel-return-new-drift-mode-improved-regen/",
    "Source": "Electrek",
    "Cluster ID": 34,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Here’s our first look at Ford’s $30,000 mid-size electric pickup",
    "Summary": "Ford is betting on its new Universal EV platform to compete with BYD and other leading Chinese brands. The first UEV-based model will be a mid-size electric pickup that Ford says will start at around $30,000. Here’s our first look at it. more….",
    "Source URL": "https://electrek.co/2026/02/05/ford-first-look-30000-mid-size-ev-pickup/",
    "Source": "Electrek",
    "Cluster ID": 35,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "America's First Car With Solid-State Batteries Could Come From This Little-Known EV Maker",
    "Summary": "Karma Automotive has not made a fully electric model yet. Its first one could ditch lithium-ions altogether for a solid-state pack.",
    "Source URL": "https://insideevs.com/news/786423/karma-automotive-factorial-energy-solid-state-evs/",
    "Source": "Inside EVs",
    "Cluster ID": 36,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Solid-state EV batteries hit a milestone in the US",
    "Summary": "Solid-state EV batteries, deemed the “holy grail” of battery tech, are moving from the lab to reality, even in the US. more….",
    "Source URL": "https://electrek.co/2026/02/05/solid-state-ev-batteries-hit-milestone-in-the-us/",
    "Source": "Electrek",
    "Cluster ID": 37,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "BMW Concept Speedtop in India image gallery",
    "Summary": "BMW has displayed the Concept Speedtop at India Art Fair 2026. First revealed at the 2025 Villa d'Este Concours, the Concept Speedtop is a coach-built shooting brake i. e. a 3-door estate with an emphasis on sportiness. It's finished in a distinctive 'Sunstone Maroon' finish and the design, at least up front, is inspired by the 2024 BMW Skytop concept.",
    "Source URL": "https://www.autocarindia.com/auto-images/bmw-concept-speedtop-in-india-image-gallery-440066",
    "Source": "Auto india",
    "Cluster ID": 38,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Tesla drops plans for robo-charging site for the SF robotaxis it doesn’t have",
    "Summary": "Tesla has abruptly decided to give up plans to build an autonomous charging station for future driverless taxis in downtown San Francisco, ahead of a public hearing on the matter. The plan had received pushback from the Teamsters union, though whether that influenced Tesla’s decision is not clear. more….",
    "Source URL": "https://electrek.co/2026/02/05/tesla-drops-plans-for-robo-charging-site-for-the-sf-robotaxis-it-doesnt-have/",
    "Source": "Electrek",
    "Cluster ID": 39,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Canada plans to replace EV sales mandate – report",
    "Summary": "The federal government is expected to drop its current EV sales mandate and introduce a system based on fuel efficiency standards and tradable credits.",
    "Source URL": "https://www.just-auto.com/news/canada-plans-replace-ev-sales-mandate/",
    "Source": "Just Auto",
    "Cluster ID": 40,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Subaru begins production of BEV Trailseeker SUV at Gunma Yajima Plant",
    "Summary": "SOP marks Subaru's first in-house production for a global BEV model – the Trailseeker SUV.",
    "Source URL": "https://www.just-auto.com/news/subaru-begins-production-of-bev-trailseeker-suv-at-gunma-yajima-plant/",
    "Source": "Just Auto",
    "Cluster ID": 41,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "CATL and Changan claim big battery breakthrough",
    "Summary": "CATL and Changan say they have shown the world’s first mass-production passenger vehicle fitted with a sodium-ion powertrain battery.",
    "Source URL": "https://www.just-auto.com/news/catl-and-changan-claim-big-battery-breakthrough/",
    "Source": "Just Auto",
    "Cluster ID": 42,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Toyota plans sharp hybrid output rise as EV incentives fade",
    "Summary": "The Japanese carmaker expects to build 6. 7 million hybrid vehicles in 2028, up from a planned five million hybrid and plug-in hybrid vehicles in 2026.",
    "Source URL": "https://www.just-auto.com/news/toyota-plans-sharp-hybrid-output-rise/",
    "Source": "Just Auto",
    "Cluster ID": 43,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "The Kia Niro Plug-In Hybrid Is Dead",
    "Summary": "The Niro PHEV is not getting a 2026 model, and its future in the U. S. is a little blurry right now.",
    "Source URL": "https://insideevs.com/news/786446/2026-kia-niro-phev-dead/",
    "Source": "Inside EVs",
    "Cluster ID": 44,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Stellantis delays EV launches after battery supply setbacks – report",
    "Summary": "The Dutch carmaker is pushing back some fully electric models by as much as eight months after manufacturing setbacks at Automotive Cells Company (ACC), sources told the news agency.",
    "Source URL": "https://www.just-auto.com/news/stellantis-delays-ev-launches/",
    "Source": "Just Auto",
    "Cluster ID": 45,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "US light vehicle market slow in January amid severe weather",
    "Summary": "On a selling day-adjusted basis, January light vehicle sales in the US fell by 3. 3% versus January last year.",
    "Source URL": "https://www.just-auto.com/industry-data/us-light-vehicle-market-slow-in-january-amid-severe-weather/",
    "Source": "Just Auto",
    "Cluster ID": 46,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "The Hyundai Kona Electric Is Not Getting A 2026 Model. Here's Why",
    "Summary": "Hyundai’s smallest and most affordable EV is skipping the 2026 model year in the United States.",
    "Source URL": "https://insideevs.com/news/786442/2026-hyundai-kona-ev-pause-us/",
    "Source": "Inside EVs",
    "Cluster ID": 47,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "VinFast’s global deliveries rise 102% in 2025",
    "Summary": "Indonesia was the company’s largest overseas market last year.",
    "Source URL": "https://www.just-auto.com/news/vinfasts-global-deliveries-rise-102-in-2025/",
    "Source": "Just Auto",
    "Cluster ID": 48,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Hyundai-Kia reports record sales in US in January",
    "Summary": "Sales of hybrids models surged 66%, while BEV sales plunged 34%.",
    "Source URL": "https://www.just-auto.com/news/hyundai-kia-reports-record-sales-in-us-in-january/",
    "Source": "Just Auto",
    "Cluster ID": 49,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Toyota launches battery-powered Pixis small van in Japan",
    "Summary": "The zero-emission ‘Kei’ delivery van was developed in collaboration with Suzuki and Daihatsu.",
    "Source URL": "https://www.just-auto.com/news/toyota-launches-battery-powered-pixis-small-van-in-japan/",
    "Source": "Just Auto",
    "Cluster ID": 50,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "S&P Global’s Mobility unit gets a new name as it gears up for independence",
    "Summary": "Press Release, 5 February 2026 S&P Global has unveiled a fresh identity for its automotive data and insights arm, announcing that Mobility Global, Inc. will be the new name for what has been known as S&P Global Mobility once it becomes an independent public company. This rebranding reflects the business’s commitment to being a central ….",
    "Source URL": "https://telematicswire.net/sp-globals-mobility-unit-gets-a-new-name-as-it-gears-up-for-independence/",
    "Source": "Telematics Wire",
    "Cluster ID": 51,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Mahindra teams up with indie to bring smart in-cabin safety tech to its electric SUVs",
    "Summary": "Press Release, 5 February 2026 Mahindra & Mahindra has joined forces with indie Semiconductor to equip its new Electric Origin SUVs with advanced in-cabin safety monitoring software. Under the deal, indie’s CABIN EYE® perception software developed by the recently acquired emotion3D team will be paired with Mahindra’s EyeDentity camera-based driver and occupant monitoring hardware. This ….",
    "Source URL": "https://telematicswire.net/mahindra-teams-up-with-indie-to-bring-smart-in-cabin-safety-tech-to-its-electric-suvs/",
    "Source": "Telematics Wire",
    "Cluster ID": 52,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Hyundai Mobis leads global push into holographic windshield displays",
    "Summary": "Press Release, 5 February 2026 Hyundai Mobis has announced a major new global collaboration aimed at transforming how drivers interact with information on the road. The company has formed a four-member “Quad Alliance” with European technology leaders ZEISS, tesa, and Saint-Gobain Sekurit to develop and industrialize next-generation Holographic Windshield Displays (HWD) for passenger vehicles. This ….",
    "Source URL": "https://telematicswire.net/hyundai-mobis-leads-global-push-into-holographic-windshield-displays/",
    "Source": "Telematics Wire",
    "Cluster ID": 53,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Xcite Automotive unveils AI-powered tool to boost vehicle photo quality compliance",
    "Summary": "Press Release, 5 February 2026 Xcite Automotive has introduced a preview of its Automated Compliance tool, a new AI and computer vision-driven solution designed to help dealerships and OEMs ensure their vehicle images meet strict brand standards with far greater speed and accuracy. Traditional photo quality checks often rely on manual inspection, a time-consuming process ….",
    "Source URL": "https://telematicswire.net/xcite-automotive-unveils-ai-powered-tool-to-boost-vehicle-photo-quality-compliance/",
    "Source": "Telematics Wire",
    "Cluster ID": 54,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "QNX & HaleyTek power next-gen software-defined audio in Volvo’s EX60 EV",
    "Summary": "Press Release, 5 February 2026 BlackBerry’s QNX division and automotive software specialist HaleyTek have teamed up to bring a fully software-defined audio (SDA) system to the upcoming Volvo EX60 electric SUV, marking a major step forward in how in-car sound is processed and delivered. This collaboration supports Volvo Cars’ Superset tech stack strategy, which focuses ….",
    "Source URL": "https://telematicswire.net/qnx-haleytek-power-next-gen-software-defined-audio-in-volvos-ex60-ev/",
    "Source": "Telematics Wire",
    "Cluster ID": 55,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-05",
    "Executive Headline": "Tesla’s new FSD push looks like a gross money grab: they have questions to anwser",
    "Summary": "Tesla is sending emails urging owners to purchase Full Self-Driving (FSD) before February 14, when the automaker switches to a subscription-only model. But in the email, Tesla appears to sneak in a policy change: FSD now only “stays with your Tesla as long as you own it. ” It also has contradicting information on its support page. more….",
    "Source URL": "https://electrek.co/2026/02/04/teslas-new-fsd-push-looks-like-a-gross-money-grab-they-have-questions-to-anwser/",
    "Source": "Electrek",
    "Cluster ID": 56,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Ford May Partner Up With A Chinese EV Company. It's Part Of A Growing Trend.",
    "Summary": "Talk about weird: This Chinese company wants to build its own EV at an American-owned car factory in Europe.",
    "Source URL": "https://insideevs.com/news/786411/ford-geely-ev-partnership-talks/",
    "Source": "Inside EVs",
    "Cluster ID": 57,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Quick Charge checks out the e-bikes at CABDA Chicago 2026",
    "Summary": "On today’s show-stopping episode of Quick Charge, we’re on location at the midwest’s largest independent bicycle dealer show checking out some of the highlights from Himiway, Radio Flyer, Rambo, and a whole lot more. more….",
    "Source URL": "https://electrek.co/2026/02/04/quick-charge-checks-out-the-e-bikes-cabda-chicago-2026/",
    "Source": "Electrek",
    "Cluster ID": 58,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "That ‘Digital Needle’ in Your Hand",
    "Summary": "Way back in 1927, a political scientist named Harold Laswell came up with a theory on mass media that some called the “Hypodermic Needle Theory. ” Laswell believed that injecting media into a passive audience had a direct and significant impact on people’s thoughts, beliefs and behaviors. Of course, in Laswell’s day, media information was primarily […] The post That ‘Digital Needle’ in Your Hand appeared first on Plugged In.",
    "Source URL": "https://www.pluggedin.com/blog/that-digital-needle-in-your-hand/",
    "Source": "Plugged In",
    "Cluster ID": 59,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Hyundai is pausing production of this electric SUV, but promises the EV will return",
    "Summary": "The Kona EV will not be available for the 2026 model year, but Hyundai says the electric SUV is not gone for good. Until then, it will still offer 2025 models. more….",
    "Source URL": "https://electrek.co/2026/02/04/hyundai-pausing-production-electric-suv/",
    "Source": "Electrek",
    "Cluster ID": 60,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "The Toyota bZ is now among America’s top-selling EVs after a surprise sales surge",
    "Summary": "Toyota is finally selling electric vehicles in the US, thanks to the new and improved bZ. After sales shot up in January, the bZ was among the best-selling EVs in the US, outpacing the Hyundai IONIQ 5. more….",
    "Source URL": "https://electrek.co/2026/02/04/toyota-bz-among-americas-top-selling-evs/",
    "Source": "Electrek",
    "Cluster ID": 61,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Anker SOLIX E10 whole-home system launch with $2,846+ savings, Velotric Discover 3 + M e-bike ear...",
    "Summary": "We’ve got two exciting launches headlining today’s Green Deals, starting with the Anker SOLIX E10 Smart Hybrid Whole-Home Backup System that is officially opening for purchase with $2,846+ savings starting from $4,299, while folks who took advantage of the pre-order promotion can save even more. Right behind it, we have the early-bird $348 perks offered by Velotric on its upcoming Discover 3 and Discover M e-bikes by simply registering your email. From there, we spotted Segway’s E3 Pro Electric.",
    "Source URL": "https://electrek.co/2026/02/04/anker-solix-e10-whole-home-system-velotric-discover-3-m-e-bike-segway-more/",
    "Source": "Electrek",
    "Cluster ID": 62,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "California’s proposed $200-million EV incentive program would require matching funds from automakers",
    "Summary": "Since the current US administration eliminated federal EV tax credits, several states have implemented their own pro-EV measures, or beefed up existing programs. In California, the administration of Governor Gavin Newsom has proposed to create a new version of the state’s Clean Vehicle Rebate Program, which ended in 2023 and spent $1. 49 billion to subsidize. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/californias-proposed-200-million-ev-incentive-program-would-require-matching-funds-from-automakers/",
    "Source": "ChargedEVs",
    "Cluster ID": 63,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Emerson updates NI Nigel AI technology for its test and measurement software platform",
    "Summary": "Emerson has released an updated version of NI Nigel AI technology for its NI LabVIEW+ Suite. This iteration of Nigel AI introduces code completion and contextual awareness of test projects and local hardware to further accelerate test development. Nigel AI is available through the LabVIEW+ Suite, a complete set of purpose-built tools created to aid. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/emerson-updates-ni-nigel-ai-technology-for-its-test-and-measurement-software-platform/",
    "Source": "ChargedEVs",
    "Cluster ID": 64,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "BMW just built the first i3 Neue Klasse EV, its most important electric sedan",
    "Summary": "The new i3 is a drastic improvement over the outgoing model as BMW’s first Neue Klasse electric sedan. After the first pre-series models rolled off the production line, BMW is preparing to begin mass production by the end of 2026. more….",
    "Source URL": "https://electrek.co/2026/02/04/bmw-built-first-neue-klasse-i3-most-important-electric-sedan/",
    "Source": "Electrek",
    "Cluster ID": 65,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Two Tesla board members are all over the Epstein files: what happens next?",
    "Summary": "How far are you willing to go to make a buck. For Tesla shareholders, looking the other way when two board members had close relationships with the head of a sex trafficking organization, and lied about it, is evidently on the table. The newly released Epstein files contain extensive correspondence involving not one, but two current Tesla board members, CEO Elon Musk and his brother Kimbal Musk. The documents directly contradict Elon’s public claims about his relationship with the convicted sex.",
    "Source URL": "https://electrek.co/2026/02/04/two-tesla-board-members-are-all-over-the-epstein-files-what-happens-next/",
    "Source": "Electrek",
    "Cluster ID": 66,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Amprius teams up with Nanotech to establish US battery cell manufacturing",
    "Summary": "US-based silicon battery anode developer Amprius Technologies has formed a manufacturing partnership with lithium-ion battery developer Nanotech Energy to expand its production footprint from Asia into the US market. Nanotech Energy is Amprius’ first US-based manufacturing partner and strengthens its ability to serve defense, aerospace, and other critical markets by providing secure, domestic production that. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/amprius-teams-up-with-nanotech-to-establish-us-battery-cell-manufacturing/",
    "Source": "ChargedEVs",
    "Cluster ID": 67,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "MiddleGround acquires Pi Innovo to integrate into New Eagle vehicle control platform",
    "Summary": "MiddleGround Capital, a private equity firm focused on middle-market B2B industrial and specialty distribution companies, has acquired Pi Innovo from Powertrain manufacturer Dana. MiddleGround will integrate Pi Innovo, which designs and develops open platform electronic control systems and control software for electrification, clean fuel and specialty mobility applications, into New Eagle, which it acquired in. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/middleground-acquires-pi-innovo-to-integrate-into-new-eagle-vehicle-control-platform/",
    "Source": "ChargedEVs",
    "Cluster ID": 68,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "We put Lucid’s Air Pure, Air Sapphire, and Gravity SUV through brutal winter testing in Northern ...",
    "Summary": "I recently put my cold-weather threshold to the test in Baudette, Minnesota, about as close to the US/Canada border as you can get with Lucid Motors, where we performed some awesome winter testing in a slew of EVs, including the Air Pure, Sapphire, and Gravity. Check out my full video review below to see us towing the Sapphire out of the snow bank with the Gravity. more….",
    "Source URL": "https://electrek.co/2026/02/04/lucid-air-pure-sapphire-gravity-winter-testing-minnesota-video/",
    "Source": "Electrek",
    "Cluster ID": 69,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Is The World's First Solid-State Battery EV Already Delayed? (Updated)",
    "Summary": "The company is now signaling that it may blow past its original target. Here's the new delivery timeline.",
    "Source URL": "https://insideevs.com/news/786388/verge-motorcycles-donut-labs-solid-state-battery-ev/",
    "Source": "Inside EVs",
    "Cluster ID": 70,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Car rental agency Midwestern Wheels provides EV charging in Wisconsin communities",
    "Summary": "Midwestern Wheels, a licensee of Avis Budget Group, is working with EV charging provider ChargePoint to deliver EV charging to its rental car customers and local residents. New public charging hubs at Midwestern Wheels’ airport and local market rental car branches in Appleton and Madison, Wisconsin are open to the public. Multiple stations feature the. Read more ».",
    "Source URL": "https://chargedevs.com/newswire/care-rental-agency-midwestern-wheels-provides-ev-charging-in-wisconsin-communities/",
    "Source": "ChargedEVs",
    "Cluster ID": 71,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "I Drove The 2026 Polestar 4. It May Be America's Weirdest EV",
    "Summary": "Polestar built a BMW-fighting faux-SUV with no rear window and a lot of horsepower. Nobody asked for it, but we're glad it's here.",
    "Source URL": "https://insideevs.com/reviews/786314/2026-polestar-4-review/",
    "Source": "Inside EVs",
    "Cluster ID": 72,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Ford has a new plan to compete with Chinese EVs: If you can’t beat ’em, join ’em",
    "Summary": "For months, Ford and Geely have been discussing a potential partnership that would allow the Chinese automaker to use underutilized plant capacity in Europe. The two appear to be closing in on a deal that would involve more than just sharing manufacturing space. more….",
    "Source URL": "https://electrek.co/2026/02/04/ford-new-plan-to-compete-with-chinese-evs/",
    "Source": "Electrek",
    "Cluster ID": 73,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Webinar: Advancements in electrified mobile hydraulic systems – a panel discussion",
    "Summary": "Designed specifically for OEM system architects, mobile hydraulics engineers, product managers, and application specialists, this 60-minute webinar (45-minute panel discussion plus 15-minute Q&A) delivers practical, actionable guidance on selecting, integrating, and validating efficient electrified mobile hydraulic architectures. Get in-depth insight into core subsystems (traction, steering, work functions, and ePTO), control strategies (positive/negative flow control, power-on-demand,. Read m.",
    "Source URL": "https://chargedevs.com/whitepapers/webinar-advancements-in-electrified-mobile-hydraulic-systems-a-panel-discussion/",
    "Source": "ChargedEVs",
    "Cluster ID": 74,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Tesla UK sales plunge 57% in January as BYD races ahead",
    "Summary": "Tesla’s struggles in Europe have reached the UK, with January 2026 registrations plunging more than 57% year-over-year to just 647 vehicles, according to new data. The decline was the steepest among major automakers and far exceeded the 6. 4% drop in overall UK battery-electric vehicle sales for the month. more….",
    "Source URL": "https://electrek.co/2026/02/04/tesla-uk-sales-plunge-57-in-january-as-byd-races-ahead/",
    "Source": "Electrek",
    "Cluster ID": 75,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "BMW's Most Important Electric Car Is One Big Step Closer To Your Driveway",
    "Summary": "Production of the electric 3 Series ramps up in the second half of 2026.",
    "Source URL": "https://insideevs.com/news/786373/bmw-i3-production-start-munich/",
    "Source": "Inside EVs",
    "Cluster ID": 76,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Tesla Has A New, Cheaper Model Y. Will It Work?",
    "Summary": "Plus: Volvo says EVs will be cheaper than gas cars soon, and Rivian's robotics venture takes shape.",
    "Source URL": "https://insideevs.com/news/786309/tesla-model-y-awd-cheaper-volvo-rivian-robotics-2026/",
    "Source": "Inside EVs",
    "Cluster ID": 77,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "10 most common transporting mistakes for large-format Li-ion batteries",
    "Summary": "Sponsored by DGeo. Transporting Li-ion batteries. Make room for mastery, not mistakes. Transporting very large format lithium batteries—for electric vehicles, solar power storage, data center backup and other purposes—is a major undertaking. Navigating the process safely, compliantly and efficiently is an ongoing challenge, and it’s not uncommon for mistakes to happen.",
    "Source URL": "https://chargedevs.com/whitepapers/10-most-common-transporting-mistakes-for-large-format-li-ion-batteries/",
    "Source": "ChargedEVs",
    "Cluster ID": 78,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "While some US states try to kill e-bikes, one is pushing more kids onto them",
    "Summary": "Across the US, the e-bike policy map is starting to look oddly contradictory. In some states, lawmakers are responding to the rise of high-powered, moped-like electric bikes by reaching for blunt instruments: licensing requirements, insurance mandates, registration schemes, and laws that effectively treat e-bikes like motorcycles. New Jersey’s recent move to scrap the widely adopted three-class system in favor of motor-vehicle-style regulation is a prime example of how quickly a state can go fro.",
    "Source URL": "https://electrek.co/2026/02/04/while-some-us-states-try-to-kill-e-bikes-one-is-pushing-more-kids-onto-them/",
    "Source": "Electrek",
    "Cluster ID": 79,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "A Tesla Model 3 Sat Overnight At -33°F. Charging And Efficiency Took A Huge Hit",
    "Summary": "The facelifted Model 3 was left outside in the freezing Canadian winter, and the owner didn’t precondition the interior or the battery.",
    "Source URL": "https://insideevs.com/news/786332/tesla-model-3-deep-freeze-night-charge-efficiency/",
    "Source": "Inside EVs",
    "Cluster ID": 80,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-04",
    "Executive Headline": "Scout's EV Factory Will Cost At Least $3 Billion",
    "Summary": "We already knew it would cost at least $2 billion. But what's another bil' among friends.",
    "Source URL": "https://insideevs.com/news/786286/scout-factory-budget-50-percent/",
    "Source": "Inside EVs",
    "Cluster ID": 81,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Boston Public Schools is installing 105 DC fast chargers – here’s why that matters",
    "Summary": "Boston Public Schools is adding another major block of depot-scale DC fast chargers as it pushes toward a fully electric bus fleet – a reminder that some of the biggest EV charging builds are happening far from highway rest stops. more….",
    "Source URL": "https://electrek.co/2026/02/03/boston-public-schools-is-installing-105-dc-fast-chargers/",
    "Source": "Electrek",
    "Cluster ID": 82,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Social Media Lawsuits and ‘The Amazing Generation’",
    "Summary": "Social media can be addictive. And when teens engage in those addictive behaviors, mental health problems follow: anxiety, depression, suicidal ideation. Because of that, several social media companies are being sued. Users claim that social media stole their childhoods. Parents of users say that social media stole their children.",
    "Source URL": "https://www.pluggedin.com/blog/social-media-lawsuits-and-the-amazing-generation/",
    "Source": "Plugged In",
    "Cluster ID": 83,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Kia’s electric van shows up in the US again, but something is different",
    "Summary": "Kia’s futuristic electric van was recently caught driving in Michigan. Although we’ve seen the PV5 testing in the US before, this one was different. more….",
    "Source URL": "https://electrek.co/2026/02/03/kias-electric-van-shows-up-in-the-us-again-but-this-one-is-different/",
    "Source": "Electrek",
    "Cluster ID": 84,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "With a $10,000 discount, the Chevy Equinox EV is hard to pass up",
    "Summary": "The 2026 Chevy Equinox EV was already one of the most affordable electric cars, but with a new $10,000 discount, it’s even more tempting. more….",
    "Source URL": "https://electrek.co/2026/02/03/10000-discount-chevy-equinox-ev-hard-to-pass-up/",
    "Source": "Electrek",
    "Cluster ID": 85,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Kia EV Sales Are In An Absolute Freefall. There's More To It Than You Think",
    "Summary": "The January sales numbers are in, and they're not good. Meanwhile, at Hyundai, EV sales are still growing.",
    "Source URL": "https://insideevs.com/news/786290/kia-ev-sales-january-2026/",
    "Source": "Inside EVs",
    "Cluster ID": 86,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Even after cutting EV incentives, Norway only sold 98 diesel cars in January",
    "Summary": "Norway, the world’s leading country in EV market share, still managed to maintain high EV market share right after retiring EV incentives, showing the world a path to resilient electrification of the auto industry. more….",
    "Source URL": "https://electrek.co/2026/02/03/even-after-cutting-ev-incentives-norway-only-sold-98-diesel-cars-in-january/",
    "Source": "Electrek",
    "Cluster ID": 87,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Jackery Super Bowl sale drops Explorer 5000 Plus power station to $2,849, Lectric XPress e-bikes,...",
    "Summary": "We’re one day closer to the Super Bowl, and as such today’s Green Deals is headlined by Jackery’s Power Your Game Sale with up to 54% power station discounts. There are even some bonus savings to score, like we’re seeing on Jackery’s Explorer 5000 Plus Portable Power Station (and bundles) starting from $2,849. We’re also shining a spotlight on Lectric’s XPress Commuter e-bikes that are getting up to $336 bundles starting from $999, as well as EcoFlow’s latest flash sale changeup that added a RIV.",
    "Source URL": "https://electrek.co/2026/02/03/jackery-super-bowl-explorer-5000-plus-power-station-lectric-e-bikes-ecoflow-more/",
    "Source": "Electrek",
    "Cluster ID": 88,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Ford drivers who go electric don’t miss gas cars ‘in the least bit,’ so where’s the EVs?",
    "Summary": "Ford says some drivers are “embracing an electric future,” with no plans to buy another ordinary gas car after experiencing the difference firsthand. more….",
    "Source URL": "https://electrek.co/2026/02/03/ford-drivers-who-go-ev-dont-miss-gas-cars-in-the-least-bit/",
    "Source": "Electrek",
    "Cluster ID": 89,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Free V2X chargers will let Massachusetts EVs power the grid",
    "Summary": "Massachusetts is turning EVs into grid assets, starting with free, bi-directional (V2X) chargers for schools, towns, and residents. more….",
    "Source URL": "https://electrek.co/2026/02/03/free-v2x-chargers-will-let-massachusetts-evs-power-the-grid/",
    "Source": "Electrek",
    "Cluster ID": 90,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "General Motors' Strategy For Building Cheaper EV Batteries: Go Hyper Local",
    "Summary": "The company already uses U. S. -made batteries. But now it's investing in sourcing American lithium and cathode active materials, too.",
    "Source URL": "https://insideevs.com/news/786281/general-motors-ev-battery-localization-efforts/",
    "Source": "Inside EVs",
    "Cluster ID": 92,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  },
  {
    "Date": "2026-02-03",
    "Executive Headline": "Hyundai and Kia kick off 2026 with a bang",
    "Summary": "Hyundai and Kia are showing no signs of slowing down after posting record-breaking January sales to start the new year. more….",
    "Source URL": "https://electrek.co/2026/02/03/hyundai-kia-kick-off-2026-with-a-bang/",
    "Source": "Electrek",
    "Cluster ID": 93,
    "execution_timestamp": "2026-02-06T14:05:55.734963"
  }
]